export const matrixRectStrs = [
  ['Пальто', 'Макароны', 'Пальто', 'Монитор', 'Сервиз'],
  ['Конструктор', 'Монитор', 'Куртизанки', 'Ковер', 'Пальто'],
  ['Сервиз', 'Монитор', 'Монитор', 'Конструктор', 'Пальто'],
  ['Сервиз', 'Пальто', 'Макароны', 'Монитор', 'Седло'],
  ['Бухло', 'Гашиш', 'Куртизанки', 'Рок-н-ролл', 'Дом престарелых'],
];

export const matrixRectStrsRes = [
  'Пальто',
  'Макароны',
  'Монитор',
  'Сервиз',
  'Конструктор',
  'Куртизанки',
  'Ковер',
  'Седло',
].sort();

export const matrixRectNums1 = [
  [1, 2, 1, 4, 8],
  [3, 7, 8, 5, 1],
  [8, 7, 7, 3, 1],
  [8, 1, 2, 7, 9],
  [6, 6, 6, 6, 6],
  [8, 1, 2, 7, 9],
  [8, 1, 2, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 2, 7, 9],
  [4, 1, 2, 7, 9],
];

export const matrixRectNums2 = [
  [6, 6, 6, 6, 6],
  [1, 2, 1, 4, 8],
  [3, 7, 8, 5, 1],
  [8, 7, 7, 3, 1],
  [8, 1, 2, 7, 9],
  [8, 1, 2, 7, 9],
  [8, 1, 2, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 6, 7, 9],
  [8, 1, 2, 7, 9],
  [4, 1, 2, 7, 9],
];

export const matrixRectNums12Res = [1, 2, 4, 8, 3, 7, 5, 9, 6].sort();

export const matrixRectNums3 = [
  [1, 2],
  [1, 3],
  [4, 5],
];

export const matrixRectNums4 = [
  [4, 5],
  [1, 2],
  [1, 3],
];

export const matrixRectNums5 = [
  [1, 2],
  [4, 5],
  [1, 3],
];

export const matrixRectNums6 = [
  [4, 5],
  [1, 3],
  [1, 2],
];

export const matrixRectNums3456Res = [1, 2, 3].sort();

// prettier-ignore
export const matrixNonRectStrs = [
  ['Пальто',      'Макароны', 'Пальто',     'Монитор',     'Сервиз',          'Монитор', 'Монитор', 'Монитор'],
  ['Конструктор', 'Монитор',  'Куртизанки', 'Ковер',       'Пальто'],
  ['Сервиз',      'Монитор',  'Монитор',    'Конструктор', 'Пальто',          'Монитор', 'Монитор', 'Монитор'],
  ['Сервиз',      'Пальто',   'Макароны',   'Монитор',     'Седло',           'Монитор', 'Монитор', 'Монитор'],
  ['Бухло',       'Гашиш',    'Куртизанки', 'Рок-н-ролл',  'Дом престарелых', 'Шишки'],
];

export const matrixNonRectStrsRes = [
  'Пальто',
  'Макароны',
  'Монитор',
  'Сервиз',
  'Конструктор',
  'Куртизанки',
  'Ковер',
  'Седло',
].sort();
